rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DIGRF_TOP.h
/*
** ###################################################################
**     Processor:           S32K37_M7
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K37 RM Rev.3
**     Version:             rev. 2.0, 2024-03-28
**     Build:               b240328
**
**     Abstract:
**         Peripheral Access Layer for S32K37_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K37_DIGRF_TOP.h
 * @version 2.0
 * @date 2024-03-28
 * @brief Peripheral Access Layer for S32K37_DIGRF_TOP
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K37_DIGRF_TOP_H_)  /* Check if memory map has not been already included */
#define S32K37_DIGRF_TOP_H_

#include "S32K37_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DIGRF_TOP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DIGRF_TOP_Peripheral_Access_Layer DIGRF_TOP Peripheral Access Layer
 * @{
 */

/** DIGRF_TOP - Size of Registers Arrays */
#define DIGRF_TOP_UNSTDR_COUNT                    9u
#define DIGRF_TOP_UNSRDR_COUNT                    9u
#define DIGRF_TOP_GPR_COUNT                       1u

/** DIGRF_TOP - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< LFAST Mode Configuration, offset: 0x0 */
  __IO uint32_t SCR;                               /**< LFAST Speed Control, offset: 0x4 */
  __IO uint32_t COCR;                              /**< LFAST Correlator Control, offset: 0x8 */
  __IO uint32_t TMCR;                              /**< LFAST Test Mode Control, offset: 0xC */
  __IO uint32_t ALCR;                              /**< LFAST Auto Loopback Control, offset: 0x10 */
  __IO uint32_t RCDCR;                             /**< LFAST Rate Change Delay Control, offset: 0x14 */
  uint8_t RESERVED_0[4];
  __IO uint32_t ICR;                               /**< LFAST ICLC Control, offset: 0x1C */
  __IO uint32_t PICR;                              /**< LFAST Ping Control, offset: 0x20 */
  uint8_t RESERVED_1[8];
  __IO uint32_t RFCR;                              /**< LFAST Rx FIFO CTS Control, offset: 0x2C */
  __IO uint32_t TIER;                              /**< LFAST Tx Interrupt Enable, offset: 0x30 */
  __IO uint32_t RIER;                              /**< LFAST Rx Interrupt Enable, offset: 0x34 */
  __IO uint32_t RIIER;                             /**< LFAST Rx ICLC Interrupt Enable, offset: 0x38 */
  __IO uint32_t PLLCR;                             /**< LFAST PLL Control, offset: 0x3C */
  __IO uint32_t LCR;                               /**< LFAST LVDS Control, offset: 0x40 */
  __IO uint32_t UNSTCR;                            /**< LFAST Unsolicited Tx Control, offset: 0x44 */
  __IO uint32_t UNSTDR[DIGRF_TOP_UNSTDR_COUNT];    /**< LFAST Unsolicited Tx Data Registers, array offset: 0x48, array step: 0x4 */
  uint8_t RESERVED_2[20];
  __I  uint32_t GSR;                               /**< LFAST Global Status, offset: 0x80 */
  __I  uint32_t PISR;                              /**< LFAST Ping Status, offset: 0x84 */
  uint8_t RESERVED_3[12];
  __I  uint32_t DFSR;                              /**< LFAST Data Frame Status, offset: 0x94 */
  __IO uint32_t TISR;                              /**< LFAST Tx Interrupt Status, offset: 0x98 */
  __IO uint32_t RISR;                              /**< LFAST Rx Interrupt Status, offset: 0x9C */
  __IO uint32_t RIISR;                             /**< LFAST Rx ICLC Interrupt Status, offset: 0xA0 */
  __I  uint32_t PLLLSR;                            /**< LFAST PLL and LVDS Status, offset: 0xA4 */
  __IO uint32_t UNSRSR;                            /**< LFAST Unsolicited Rx Status, offset: 0xA8 */
  __I  uint32_t UNSRDR[DIGRF_TOP_UNSRDR_COUNT];    /**< LFAST Unsolicited Rx Data, array offset: 0xAC, array step: 0x4 */
  uint8_t RESERVED_4[4];
  __IO uint32_t GPR[DIGRF_TOP_GPR_COUNT];          /**< General Purpose registers, array offset: 0xD4, array step: 0x4 */
} DIGRF_TOP_Type, *DIGRF_TOP_MemMapPtr;

/** Number of instances of the DIGRF_TOP module. */
#define DIGRF_TOP_INSTANCE_COUNT                 (1u)

/* DIGRF_TOP - Peripheral instance base addresses */
/** Peripheral DIGRF_TOP base address */
#define IP_DIGRF_TOP_BASE                        (0x404F4000u)
/** Peripheral DIGRF_TOP base pointer */
#define IP_DIGRF_TOP                             ((DIGRF_TOP_Type *)IP_DIGRF_TOP_BASE)
/** Array initializer of DIGRF_TOP peripheral base addresses */
#define IP_DIGRF_TOP_BASE_ADDRS                  { IP_DIGRF_TOP_BASE }
/** Array initializer of DIGRF_TOP peripheral base pointers */
#define IP_DIGRF_TOP_BASE_PTRS                   { IP_DIGRF_TOP }

/* ----------------------------------------------------------------------------
   -- DIGRF_TOP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DIGRF_TOP_Register_Masks DIGRF_TOP Register Masks
 * @{
 */

/*! @name MCR - LFAST Mode Configuration */
/*! @{ */

#define DIGRF_TOP_MCR_DATAEN_MASK                (0x1U)
#define DIGRF_TOP_MCR_DATAEN_SHIFT               (0U)
#define DIGRF_TOP_MCR_DATAEN_WIDTH               (1U)
#define DIGRF_TOP_MCR_DATAEN(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_DATAEN_SHIFT)) & DIGRF_TOP_MCR_DATAEN_MASK)

