rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DIGRF_TOP.h
#define DIGRF_TOP_MCR_DRFRST_MASK                (0x2U)
#define DIGRF_TOP_MCR_DRFRST_SHIFT               (1U)
#define DIGRF_TOP_MCR_DRFRST_WIDTH               (1U)
#define DIGRF_TOP_MCR_DRFRST(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_DRFRST_SHIFT)) & DIGRF_TOP_MCR_DRFRST_MASK)

#define DIGRF_TOP_MCR_CTSEN_MASK                 (0x8U)
#define DIGRF_TOP_MCR_CTSEN_SHIFT                (3U)
#define DIGRF_TOP_MCR_CTSEN_WIDTH                (1U)
#define DIGRF_TOP_MCR_CTSEN(x)                   (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_CTSEN_SHIFT)) & DIGRF_TOP_MCR_CTSEN_MASK)

#define DIGRF_TOP_MCR_TXARBD_MASK                (0x10U)
#define DIGRF_TOP_MCR_TXARBD_SHIFT               (4U)
#define DIGRF_TOP_MCR_TXARBD_WIDTH               (1U)
#define DIGRF_TOP_MCR_TXARBD(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_TXARBD_SHIFT)) & DIGRF_TOP_MCR_TXARBD_MASK)

#define DIGRF_TOP_MCR_TXEN_MASK                  (0x2000U)
#define DIGRF_TOP_MCR_TXEN_SHIFT                 (13U)
#define DIGRF_TOP_MCR_TXEN_WIDTH                 (1U)
#define DIGRF_TOP_MCR_TXEN(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_TXEN_SHIFT)) & DIGRF_TOP_MCR_TXEN_MASK)

#define DIGRF_TOP_MCR_RXEN_MASK                  (0x4000U)
#define DIGRF_TOP_MCR_RXEN_SHIFT                 (14U)
#define DIGRF_TOP_MCR_RXEN_WIDTH                 (1U)
#define DIGRF_TOP_MCR_RXEN(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_RXEN_SHIFT)) & DIGRF_TOP_MCR_RXEN_MASK)

#define DIGRF_TOP_MCR_DRFEN_MASK                 (0x8000U)
#define DIGRF_TOP_MCR_DRFEN_SHIFT                (15U)
#define DIGRF_TOP_MCR_DRFEN_WIDTH                (1U)
#define DIGRF_TOP_MCR_DRFEN(x)                   (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_DRFEN_SHIFT)) & DIGRF_TOP_MCR_DRFEN_MASK)

#define DIGRF_TOP_MCR_LSSEL_MASK                 (0x10000U)
#define DIGRF_TOP_MCR_LSSEL_SHIFT                (16U)
#define DIGRF_TOP_MCR_LSSEL_WIDTH                (1U)
#define DIGRF_TOP_MCR_LSSEL(x)                   (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_LSSEL_SHIFT)) & DIGRF_TOP_MCR_LSSEL_MASK)

#define DIGRF_TOP_MCR_IPGDBG_MASK                (0x1000000U)
#define DIGRF_TOP_MCR_IPGDBG_SHIFT               (24U)
#define DIGRF_TOP_MCR_IPGDBG_WIDTH               (1U)
#define DIGRF_TOP_MCR_IPGDBG(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_IPGDBG_SHIFT)) & DIGRF_TOP_MCR_IPGDBG_MASK)

#define DIGRF_TOP_MCR_MSEN_MASK                  (0x80000000U)
#define DIGRF_TOP_MCR_MSEN_SHIFT                 (31U)
#define DIGRF_TOP_MCR_MSEN_WIDTH                 (1U)
#define DIGRF_TOP_MCR_MSEN(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_MCR_MSEN_SHIFT)) & DIGRF_TOP_MCR_MSEN_MASK)
/*! @} */

/*! @name SCR - LFAST Speed Control */
/*! @{ */

#define DIGRF_TOP_SCR_TDR_MASK                   (0x1U)
#define DIGRF_TOP_SCR_TDR_SHIFT                  (0U)
#define DIGRF_TOP_SCR_TDR_WIDTH                  (1U)
#define DIGRF_TOP_SCR_TDR(x)                     (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SCR_TDR_SHIFT)) & DIGRF_TOP_SCR_TDR_MASK)

#define DIGRF_TOP_SCR_RDR_MASK                   (0x100U)
#define DIGRF_TOP_SCR_RDR_SHIFT                  (8U)
#define DIGRF_TOP_SCR_RDR_WIDTH                  (1U)
#define DIGRF_TOP_SCR_RDR(x)                     (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SCR_RDR_SHIFT)) & DIGRF_TOP_SCR_RDR_MASK)

#define DIGRF_TOP_SCR_DRMD_MASK                  (0x10000U)
#define DIGRF_TOP_SCR_DRMD_SHIFT                 (16U)
#define DIGRF_TOP_SCR_DRMD_WIDTH                 (1U)
#define DIGRF_TOP_SCR_DRMD(x)                    (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_SCR_DRMD_SHIFT)) & DIGRF_TOP_SCR_DRMD_MASK)
/*! @} */

/*! @name COCR - LFAST Correlator Control */
/*! @{ */

#define DIGRF_TOP_COCR_PHSSEL_MASK               (0x1U)
#define DIGRF_TOP_COCR_PHSSEL_SHIFT              (0U)
#define DIGRF_TOP_COCR_PHSSEL_WIDTH              (1U)
#define DIGRF_TOP_COCR_PHSSEL(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_COCR_PHSSEL_SHIFT)) & DIGRF_TOP_COCR_PHSSEL_MASK)

#define DIGRF_TOP_COCR_CORRTH_MASK               (0xEU)
#define DIGRF_TOP_COCR_CORRTH_SHIFT              (1U)
#define DIGRF_TOP_COCR_CORRTH_WIDTH              (3U)
#define DIGRF_TOP_COCR_CORRTH(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_COCR_CORRTH_SHIFT)) & DIGRF_TOP_COCR_CORRTH_MASK)

#define DIGRF_TOP_COCR_SMPSEL_MASK               (0xFF000000U)
#define DIGRF_TOP_COCR_SMPSEL_SHIFT              (24U)
#define DIGRF_TOP_COCR_SMPSEL_WIDTH              (8U)
#define DIGRF_TOP_COCR_SMPSEL(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_COCR_SMPSEL_SHIFT)) & DIGRF_TOP_COCR_SMPSEL_MASK)
/*! @} */

/*! @name TMCR - LFAST Test Mode Control */
/*! @{ */

#define DIGRF_TOP_TMCR_LPFRMTH_MASK              (0xFFFFU)
#define DIGRF_TOP_TMCR_LPFRMTH_SHIFT             (0U)
#define DIGRF_TOP_TMCR_LPFRMTH_WIDTH             (16U)
#define DIGRF_TOP_TMCR_LPFRMTH(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TMCR_LPFRMTH_SHIFT)) & DIGRF_TOP_TMCR_LPFRMTH_MASK)

#define DIGRF_TOP_TMCR_LPMOD_MASK                (0x70000U)
#define DIGRF_TOP_TMCR_LPMOD_SHIFT               (16U)
#define DIGRF_TOP_TMCR_LPMOD_WIDTH               (3U)
#define DIGRF_TOP_TMCR_LPMOD(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TMCR_LPMOD_SHIFT)) & DIGRF_TOP_TMCR_LPMOD_MASK)

#define DIGRF_TOP_TMCR_LPON_MASK                 (0x1000000U)
#define DIGRF_TOP_TMCR_LPON_SHIFT                (24U)
#define DIGRF_TOP_TMCR_LPON_WIDTH                (1U)
#define DIGRF_TOP_TMCR_LPON(x)                   (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TMCR_LPON_SHIFT)) & DIGRF_TOP_TMCR_LPON_MASK)

#define DIGRF_TOP_TMCR_CLKTST_MASK               (0x2000000U)
#define DIGRF_TOP_TMCR_CLKTST_SHIFT              (25U)
#define DIGRF_TOP_TMCR_CLKTST_WIDTH              (1U)
#define DIGRF_TOP_TMCR_CLKTST(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_TMCR_CLKTST_SHIFT)) & DIGRF_TOP_TMCR_CLKTST_MASK)
/*! @} */

/*! @name ALCR - LFAST Auto Loopback Control */
/*! @{ */

#define DIGRF_TOP_ALCR_LPFMCNT_MASK              (0xFFFFU)
#define DIGRF_TOP_ALCR_LPFMCNT_SHIFT             (0U)
#define DIGRF_TOP_ALCR_LPFMCNT_WIDTH             (16U)
#define DIGRF_TOP_ALCR_LPFMCNT(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_ALCR_LPFMCNT_SHIFT)) & DIGRF_TOP_ALCR_LPFMCNT_MASK)

