rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DIGRF_TOP.h
#define DIGRF_TOP_RIER_RXICIE_MASK               (0x20000U)
#define DIGRF_TOP_RIER_RXICIE_SHIFT              (17U)
#define DIGRF_TOP_RIER_RXICIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXICIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXICIE_SHIFT)) & DIGRF_TOP_RIER_RXICIE_MASK)

#define DIGRF_TOP_RIER_RXSZIE_MASK               (0x40000U)
#define DIGRF_TOP_RIER_RXSZIE_SHIFT              (18U)
#define DIGRF_TOP_RIER_RXSZIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXSZIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXSZIE_SHIFT)) & DIGRF_TOP_RIER_RXSZIE_MASK)

#define DIGRF_TOP_RIER_RXOFIE_MASK               (0x80000U)
#define DIGRF_TOP_RIER_RXOFIE_SHIFT              (19U)
#define DIGRF_TOP_RIER_RXOFIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXOFIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXOFIE_SHIFT)) & DIGRF_TOP_RIER_RXOFIE_MASK)

#define DIGRF_TOP_RIER_RXUFIE_MASK               (0x100000U)
#define DIGRF_TOP_RIER_RXUFIE_SHIFT              (20U)
#define DIGRF_TOP_RIER_RXUFIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXUFIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXUFIE_SHIFT)) & DIGRF_TOP_RIER_RXUFIE_MASK)

#define DIGRF_TOP_RIER_RXMXIE_MASK               (0x200000U)
#define DIGRF_TOP_RIER_RXMXIE_SHIFT              (21U)
#define DIGRF_TOP_RIER_RXMXIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXMXIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXMXIE_SHIFT)) & DIGRF_TOP_RIER_RXMXIE_MASK)

#define DIGRF_TOP_RIER_RXMNIE_MASK               (0x400000U)
#define DIGRF_TOP_RIER_RXMNIE_SHIFT              (22U)
#define DIGRF_TOP_RIER_RXMNIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXMNIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXMNIE_SHIFT)) & DIGRF_TOP_RIER_RXMNIE_MASK)

#define DIGRF_TOP_RIER_RXUOIE_MASK               (0x800000U)
#define DIGRF_TOP_RIER_RXUOIE_SHIFT              (23U)
#define DIGRF_TOP_RIER_RXUOIE_WIDTH              (1U)
#define DIGRF_TOP_RIER_RXUOIE(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIER_RXUOIE_SHIFT)) & DIGRF_TOP_RIER_RXUOIE_MASK)
/*! @} */

/*! @name RIIER - LFAST Rx ICLC Interrupt Enable */
/*! @{ */

#define DIGRF_TOP_RIIER_ICPONIE_MASK             (0x1U)
#define DIGRF_TOP_RIIER_ICPONIE_SHIFT            (0U)
#define DIGRF_TOP_RIIER_ICPONIE_WIDTH            (1U)
#define DIGRF_TOP_RIIER_ICPONIE(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICPONIE_SHIFT)) & DIGRF_TOP_RIIER_ICPONIE_MASK)

#define DIGRF_TOP_RIIER_ICPOFIE_MASK             (0x2U)
#define DIGRF_TOP_RIIER_ICPOFIE_SHIFT            (1U)
#define DIGRF_TOP_RIIER_ICPOFIE_WIDTH            (1U)
#define DIGRF_TOP_RIIER_ICPOFIE(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICPOFIE_SHIFT)) & DIGRF_TOP_RIIER_ICPOFIE_MASK)

#define DIGRF_TOP_RIIER_ICTSIE_MASK              (0x4U)
#define DIGRF_TOP_RIIER_ICTSIE_SHIFT             (2U)
#define DIGRF_TOP_RIIER_ICTSIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICTSIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICTSIE_SHIFT)) & DIGRF_TOP_RIIER_ICTSIE_MASK)

#define DIGRF_TOP_RIIER_ICTFIE_MASK              (0x8U)
#define DIGRF_TOP_RIIER_ICTFIE_SHIFT             (3U)
#define DIGRF_TOP_RIIER_ICTFIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICTFIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICTFIE_SHIFT)) & DIGRF_TOP_RIIER_ICTFIE_MASK)

#define DIGRF_TOP_RIIER_ICRSIE_MASK              (0x10U)
#define DIGRF_TOP_RIIER_ICRSIE_SHIFT             (4U)
#define DIGRF_TOP_RIIER_ICRSIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICRSIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICRSIE_SHIFT)) & DIGRF_TOP_RIIER_ICRSIE_MASK)

#define DIGRF_TOP_RIIER_ICRFIE_MASK              (0x20U)
#define DIGRF_TOP_RIIER_ICRFIE_SHIFT             (5U)
#define DIGRF_TOP_RIIER_ICRFIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICRFIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICRFIE_SHIFT)) & DIGRF_TOP_RIIER_ICRFIE_MASK)

#define DIGRF_TOP_RIIER_ICTEIE_MASK              (0x40U)
#define DIGRF_TOP_RIIER_ICTEIE_SHIFT             (6U)
#define DIGRF_TOP_RIIER_ICTEIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICTEIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICTEIE_SHIFT)) & DIGRF_TOP_RIIER_ICTEIE_MASK)

#define DIGRF_TOP_RIIER_ICTDIE_MASK              (0x80U)
#define DIGRF_TOP_RIIER_ICTDIE_SHIFT             (7U)
#define DIGRF_TOP_RIIER_ICTDIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICTDIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICTDIE_SHIFT)) & DIGRF_TOP_RIIER_ICTDIE_MASK)

#define DIGRF_TOP_RIIER_ICCTIE_MASK              (0x100U)
#define DIGRF_TOP_RIIER_ICCTIE_SHIFT             (8U)
#define DIGRF_TOP_RIIER_ICCTIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICCTIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICCTIE_SHIFT)) & DIGRF_TOP_RIIER_ICCTIE_MASK)

#define DIGRF_TOP_RIIER_ICLPIE_MASK              (0x200U)
#define DIGRF_TOP_RIIER_ICLPIE_SHIFT             (9U)
#define DIGRF_TOP_RIIER_ICLPIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICLPIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICLPIE_SHIFT)) & DIGRF_TOP_RIIER_ICLPIE_MASK)

#define DIGRF_TOP_RIIER_ICTOIE_MASK              (0x400U)
#define DIGRF_TOP_RIIER_ICTOIE_SHIFT             (10U)
#define DIGRF_TOP_RIIER_ICTOIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICTOIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICTOIE_SHIFT)) & DIGRF_TOP_RIIER_ICTOIE_MASK)

#define DIGRF_TOP_RIIER_ICPRIE_MASK              (0x800U)
#define DIGRF_TOP_RIIER_ICPRIE_SHIFT             (11U)
#define DIGRF_TOP_RIIER_ICPRIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICPRIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICPRIE_SHIFT)) & DIGRF_TOP_RIIER_ICPRIE_MASK)

#define DIGRF_TOP_RIIER_ICPSIE_MASK              (0x1000U)
#define DIGRF_TOP_RIIER_ICPSIE_SHIFT             (12U)
#define DIGRF_TOP_RIIER_ICPSIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICPSIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICPSIE_SHIFT)) & DIGRF_TOP_RIIER_ICPSIE_MASK)

