rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DIGRF_TOP.h
#define DIGRF_TOP_RIIER_ICPFIE_MASK              (0x2000U)
#define DIGRF_TOP_RIIER_ICPFIE_SHIFT             (13U)
#define DIGRF_TOP_RIIER_ICPFIE_WIDTH             (1U)
#define DIGRF_TOP_RIIER_ICPFIE(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIIER_ICPFIE_SHIFT)) & DIGRF_TOP_RIIER_ICPFIE_MASK)
/*! @} */

/*! @name PLLCR - LFAST PLL Control */
/*! @{ */

#define DIGRF_TOP_PLLCR_PREDIV_MASK              (0x3U)
#define DIGRF_TOP_PLLCR_PREDIV_SHIFT             (0U)
#define DIGRF_TOP_PLLCR_PREDIV_WIDTH             (2U)
#define DIGRF_TOP_PLLCR_PREDIV(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLCR_PREDIV_SHIFT)) & DIGRF_TOP_PLLCR_PREDIV_MASK)

#define DIGRF_TOP_PLLCR_FBDIV_MASK               (0xFCU)
#define DIGRF_TOP_PLLCR_FBDIV_SHIFT              (2U)
#define DIGRF_TOP_PLLCR_FBDIV_WIDTH              (6U)
#define DIGRF_TOP_PLLCR_FBDIV(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLCR_FBDIV_SHIFT)) & DIGRF_TOP_PLLCR_FBDIV_MASK)

#define DIGRF_TOP_PLLCR_FDIVEN_MASK              (0x100U)
#define DIGRF_TOP_PLLCR_FDIVEN_SHIFT             (8U)
#define DIGRF_TOP_PLLCR_FDIVEN_WIDTH             (1U)
#define DIGRF_TOP_PLLCR_FDIVEN(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLCR_FDIVEN_SHIFT)) & DIGRF_TOP_PLLCR_FDIVEN_MASK)

#define DIGRF_TOP_PLLCR_REFINV_MASK              (0x8000U)
#define DIGRF_TOP_PLLCR_REFINV_SHIFT             (15U)
#define DIGRF_TOP_PLLCR_REFINV_WIDTH             (1U)
#define DIGRF_TOP_PLLCR_REFINV(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLCR_REFINV_SHIFT)) & DIGRF_TOP_PLLCR_REFINV_MASK)

#define DIGRF_TOP_PLLCR_SWPON_MASK               (0x10000U)
#define DIGRF_TOP_PLLCR_SWPON_SHIFT              (16U)
#define DIGRF_TOP_PLLCR_SWPON_WIDTH              (1U)
#define DIGRF_TOP_PLLCR_SWPON(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLCR_SWPON_SHIFT)) & DIGRF_TOP_PLLCR_SWPON_MASK)

#define DIGRF_TOP_PLLCR_SWPOFF_MASK              (0x20000U)
#define DIGRF_TOP_PLLCR_SWPOFF_SHIFT             (17U)
#define DIGRF_TOP_PLLCR_SWPOFF_WIDTH             (1U)
#define DIGRF_TOP_PLLCR_SWPOFF(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLCR_SWPOFF_SHIFT)) & DIGRF_TOP_PLLCR_SWPOFF_MASK)
/*! @} */

/*! @name LCR - LFAST LVDS Control */
/*! @{ */

#define DIGRF_TOP_LCR_LVRXOP_BR_MASK             (0x8U)
#define DIGRF_TOP_LCR_LVRXOP_BR_SHIFT            (3U)
#define DIGRF_TOP_LCR_LVRXOP_BR_WIDTH            (1U)
#define DIGRF_TOP_LCR_LVRXOP_BR(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_LVRXOP_BR_SHIFT)) & DIGRF_TOP_LCR_LVRXOP_BR_MASK)

#define DIGRF_TOP_LCR_LVRXOP_TR_MASK             (0x20U)
#define DIGRF_TOP_LCR_LVRXOP_TR_SHIFT            (5U)
#define DIGRF_TOP_LCR_LVRXOP_TR_WIDTH            (1U)
#define DIGRF_TOP_LCR_LVRXOP_TR(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_LVRXOP_TR_SHIFT)) & DIGRF_TOP_LCR_LVRXOP_TR_MASK)

#define DIGRF_TOP_LCR_LVLPEN_MASK                (0x800U)
#define DIGRF_TOP_LCR_LVLPEN_SHIFT               (11U)
#define DIGRF_TOP_LCR_LVLPEN_WIDTH               (1U)
#define DIGRF_TOP_LCR_LVLPEN(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_LVLPEN_SHIFT)) & DIGRF_TOP_LCR_LVLPEN_MASK)

#define DIGRF_TOP_LCR_LVRFEN_MASK                (0x1000U)
#define DIGRF_TOP_LCR_LVRFEN_SHIFT               (12U)
#define DIGRF_TOP_LCR_LVRFEN_WIDTH               (1U)
#define DIGRF_TOP_LCR_LVRFEN(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_LVRFEN_SHIFT)) & DIGRF_TOP_LCR_LVRFEN_MASK)

#define DIGRF_TOP_LCR_TXCMUX_MASK                (0x2000U)
#define DIGRF_TOP_LCR_TXCMUX_SHIFT               (13U)
#define DIGRF_TOP_LCR_TXCMUX_WIDTH               (1U)
#define DIGRF_TOP_LCR_TXCMUX(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_TXCMUX_SHIFT)) & DIGRF_TOP_LCR_TXCMUX_MASK)

#define DIGRF_TOP_LCR_LVTXOE_MASK                (0x4000U)
#define DIGRF_TOP_LCR_LVTXOE_SHIFT               (14U)
#define DIGRF_TOP_LCR_LVTXOE_WIDTH               (1U)
#define DIGRF_TOP_LCR_LVTXOE(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_LVTXOE_SHIFT)) & DIGRF_TOP_LCR_LVTXOE_MASK)

#define DIGRF_TOP_LCR_LVRXOFF_MASK               (0x8000U)
#define DIGRF_TOP_LCR_LVRXOFF_SHIFT              (15U)
#define DIGRF_TOP_LCR_LVRXOFF_WIDTH              (1U)
#define DIGRF_TOP_LCR_LVRXOFF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_LVRXOFF_SHIFT)) & DIGRF_TOP_LCR_LVRXOFF_MASK)

#define DIGRF_TOP_LCR_SWONLR_MASK                (0x10000U)
#define DIGRF_TOP_LCR_SWONLR_SHIFT               (16U)
#define DIGRF_TOP_LCR_SWONLR_WIDTH               (1U)
#define DIGRF_TOP_LCR_SWONLR(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWONLR_SHIFT)) & DIGRF_TOP_LCR_SWONLR_MASK)

#define DIGRF_TOP_LCR_SWOFFLR_MASK               (0x20000U)
#define DIGRF_TOP_LCR_SWOFFLR_SHIFT              (17U)
#define DIGRF_TOP_LCR_SWOFFLR_WIDTH              (1U)
#define DIGRF_TOP_LCR_SWOFFLR(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWOFFLR_SHIFT)) & DIGRF_TOP_LCR_SWOFFLR_MASK)

#define DIGRF_TOP_LCR_SWONLD_MASK                (0x40000U)
#define DIGRF_TOP_LCR_SWONLD_SHIFT               (18U)
#define DIGRF_TOP_LCR_SWONLD_WIDTH               (1U)
#define DIGRF_TOP_LCR_SWONLD(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWONLD_SHIFT)) & DIGRF_TOP_LCR_SWONLD_MASK)

#define DIGRF_TOP_LCR_SWOFFLD_MASK               (0x80000U)
#define DIGRF_TOP_LCR_SWOFFLD_SHIFT              (19U)
#define DIGRF_TOP_LCR_SWOFFLD_WIDTH              (1U)
#define DIGRF_TOP_LCR_SWOFFLD(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWOFFLD_SHIFT)) & DIGRF_TOP_LCR_SWOFFLD_MASK)

#define DIGRF_TOP_LCR_SWSLPLR_MASK               (0x100000U)
#define DIGRF_TOP_LCR_SWSLPLR_SHIFT              (20U)
#define DIGRF_TOP_LCR_SWSLPLR_WIDTH              (1U)
#define DIGRF_TOP_LCR_SWSLPLR(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWSLPLR_SHIFT)) & DIGRF_TOP_LCR_SWSLPLR_MASK)

#define DIGRF_TOP_LCR_SWWKLR_MASK                (0x200000U)
#define DIGRF_TOP_LCR_SWWKLR_SHIFT               (21U)
#define DIGRF_TOP_LCR_SWWKLR_WIDTH               (1U)
#define DIGRF_TOP_LCR_SWWKLR(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_LCR_SWWKLR_SHIFT)) & DIGRF_TOP_LCR_SWWKLR_MASK)

