rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DIGRF_TOP.h
/*! @name RISR - LFAST Rx Interrupt Status */
/*! @{ */

#define DIGRF_TOP_RISR_RXUNSF_MASK               (0x2U)
#define DIGRF_TOP_RISR_RXUNSF_SHIFT              (1U)
#define DIGRF_TOP_RISR_RXUNSF_WIDTH              (1U)
#define DIGRF_TOP_RISR_RXUNSF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXUNSF_SHIFT)) & DIGRF_TOP_RISR_RXUNSF_MASK)

#define DIGRF_TOP_RISR_RXDF_MASK                 (0x4U)
#define DIGRF_TOP_RISR_RXDF_SHIFT                (2U)
#define DIGRF_TOP_RISR_RXDF_WIDTH                (1U)
#define DIGRF_TOP_RISR_RXDF(x)                   (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXDF_SHIFT)) & DIGRF_TOP_RISR_RXDF_MASK)

#define DIGRF_TOP_RISR_RXCTSF_MASK               (0x8U)
#define DIGRF_TOP_RISR_RXCTSF_SHIFT              (3U)
#define DIGRF_TOP_RISR_RXCTSF_WIDTH              (1U)
#define DIGRF_TOP_RISR_RXCTSF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXCTSF_SHIFT)) & DIGRF_TOP_RISR_RXCTSF_MASK)

#define DIGRF_TOP_RISR_RXLCEF_MASK               (0x10000U)
#define DIGRF_TOP_RISR_RXLCEF_SHIFT              (16U)
#define DIGRF_TOP_RISR_RXLCEF_WIDTH              (1U)
#define DIGRF_TOP_RISR_RXLCEF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXLCEF_SHIFT)) & DIGRF_TOP_RISR_RXLCEF_MASK)

#define DIGRF_TOP_RISR_RXICF_MASK                (0x20000U)
#define DIGRF_TOP_RISR_RXICF_SHIFT               (17U)
#define DIGRF_TOP_RISR_RXICF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXICF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXICF_SHIFT)) & DIGRF_TOP_RISR_RXICF_MASK)

#define DIGRF_TOP_RISR_RXSZF_MASK                (0x40000U)
#define DIGRF_TOP_RISR_RXSZF_SHIFT               (18U)
#define DIGRF_TOP_RISR_RXSZF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXSZF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXSZF_SHIFT)) & DIGRF_TOP_RISR_RXSZF_MASK)

#define DIGRF_TOP_RISR_RXOFF_MASK                (0x80000U)
#define DIGRF_TOP_RISR_RXOFF_SHIFT               (19U)
#define DIGRF_TOP_RISR_RXOFF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXOFF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXOFF_SHIFT)) & DIGRF_TOP_RISR_RXOFF_MASK)

#define DIGRF_TOP_RISR_RXUFF_MASK                (0x100000U)
#define DIGRF_TOP_RISR_RXUFF_SHIFT               (20U)
#define DIGRF_TOP_RISR_RXUFF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXUFF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXUFF_SHIFT)) & DIGRF_TOP_RISR_RXUFF_MASK)

#define DIGRF_TOP_RISR_RXMXF_MASK                (0x200000U)
#define DIGRF_TOP_RISR_RXMXF_SHIFT               (21U)
#define DIGRF_TOP_RISR_RXMXF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXMXF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXMXF_SHIFT)) & DIGRF_TOP_RISR_RXMXF_MASK)

#define DIGRF_TOP_RISR_RXMNF_MASK                (0x400000U)
#define DIGRF_TOP_RISR_RXMNF_SHIFT               (22U)
#define DIGRF_TOP_RISR_RXMNF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXMNF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXMNF_SHIFT)) & DIGRF_TOP_RISR_RXMNF_MASK)

#define DIGRF_TOP_RISR_RXUOF_MASK                (0x800000U)
#define DIGRF_TOP_RISR_RXUOF_SHIFT               (23U)
#define DIGRF_TOP_RISR_RXUOF_WIDTH               (1U)
#define DIGRF_TOP_RISR_RXUOF(x)                  (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RISR_RXUOF_SHIFT)) & DIGRF_TOP_RISR_RXUOF_MASK)
/*! @} */

/*! @name RIISR - LFAST Rx ICLC Interrupt Status */
/*! @{ */

#define DIGRF_TOP_RIISR_ICPONF_MASK              (0x1U)
#define DIGRF_TOP_RIISR_ICPONF_SHIFT             (0U)
#define DIGRF_TOP_RIISR_ICPONF_WIDTH             (1U)
#define DIGRF_TOP_RIISR_ICPONF(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICPONF_SHIFT)) & DIGRF_TOP_RIISR_ICPONF_MASK)

#define DIGRF_TOP_RIISR_ICPOFF_MASK              (0x2U)
#define DIGRF_TOP_RIISR_ICPOFF_SHIFT             (1U)
#define DIGRF_TOP_RIISR_ICPOFF_WIDTH             (1U)
#define DIGRF_TOP_RIISR_ICPOFF(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICPOFF_SHIFT)) & DIGRF_TOP_RIISR_ICPOFF_MASK)

#define DIGRF_TOP_RIISR_ICTSF_MASK               (0x4U)
#define DIGRF_TOP_RIISR_ICTSF_SHIFT              (2U)
#define DIGRF_TOP_RIISR_ICTSF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICTSF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICTSF_SHIFT)) & DIGRF_TOP_RIISR_ICTSF_MASK)

#define DIGRF_TOP_RIISR_ICTFF_MASK               (0x8U)
#define DIGRF_TOP_RIISR_ICTFF_SHIFT              (3U)
#define DIGRF_TOP_RIISR_ICTFF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICTFF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICTFF_SHIFT)) & DIGRF_TOP_RIISR_ICTFF_MASK)

#define DIGRF_TOP_RIISR_ICRSF_MASK               (0x10U)
#define DIGRF_TOP_RIISR_ICRSF_SHIFT              (4U)
#define DIGRF_TOP_RIISR_ICRSF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICRSF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICRSF_SHIFT)) & DIGRF_TOP_RIISR_ICRSF_MASK)

#define DIGRF_TOP_RIISR_ICRFF_MASK               (0x20U)
#define DIGRF_TOP_RIISR_ICRFF_SHIFT              (5U)
#define DIGRF_TOP_RIISR_ICRFF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICRFF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICRFF_SHIFT)) & DIGRF_TOP_RIISR_ICRFF_MASK)

#define DIGRF_TOP_RIISR_ICTEF_MASK               (0x40U)
#define DIGRF_TOP_RIISR_ICTEF_SHIFT              (6U)
#define DIGRF_TOP_RIISR_ICTEF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICTEF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICTEF_SHIFT)) & DIGRF_TOP_RIISR_ICTEF_MASK)

#define DIGRF_TOP_RIISR_ICTDF_MASK               (0x80U)
#define DIGRF_TOP_RIISR_ICTDF_SHIFT              (7U)
#define DIGRF_TOP_RIISR_ICTDF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICTDF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICTDF_SHIFT)) & DIGRF_TOP_RIISR_ICTDF_MASK)

#define DIGRF_TOP_RIISR_ICCTF_MASK               (0x100U)
#define DIGRF_TOP_RIISR_ICCTF_SHIFT              (8U)
#define DIGRF_TOP_RIISR_ICCTF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICCTF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICCTF_SHIFT)) & DIGRF_TOP_RIISR_ICCTF_MASK)

#define DIGRF_TOP_RIISR_ICLPF_MASK               (0x200U)
#define DIGRF_TOP_RIISR_ICLPF_SHIFT              (9U)
#define DIGRF_TOP_RIISR_ICLPF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICLPF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICLPF_SHIFT)) & DIGRF_TOP_RIISR_ICLPF_MASK)

#define DIGRF_TOP_RIISR_ICTOF_MASK               (0x400U)
#define DIGRF_TOP_RIISR_ICTOF_SHIFT              (10U)
#define DIGRF_TOP_RIISR_ICTOF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICTOF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICTOF_SHIFT)) & DIGRF_TOP_RIISR_ICTOF_MASK)

