rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DIGRF_TOP.h
#define DIGRF_TOP_RIISR_ICPRF_MASK               (0x800U)
#define DIGRF_TOP_RIISR_ICPRF_SHIFT              (11U)
#define DIGRF_TOP_RIISR_ICPRF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICPRF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICPRF_SHIFT)) & DIGRF_TOP_RIISR_ICPRF_MASK)

#define DIGRF_TOP_RIISR_ICPSF_MASK               (0x1000U)
#define DIGRF_TOP_RIISR_ICPSF_SHIFT              (12U)
#define DIGRF_TOP_RIISR_ICPSF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICPSF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICPSF_SHIFT)) & DIGRF_TOP_RIISR_ICPSF_MASK)

#define DIGRF_TOP_RIISR_ICPFF_MASK               (0x2000U)
#define DIGRF_TOP_RIISR_ICPFF_SHIFT              (13U)
#define DIGRF_TOP_RIISR_ICPFF_WIDTH              (1U)
#define DIGRF_TOP_RIISR_ICPFF(x)                 (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_RIISR_ICPFF_SHIFT)) & DIGRF_TOP_RIISR_ICPFF_MASK)
/*! @} */

/*! @name PLLLSR - LFAST PLL and LVDS Status */
/*! @{ */

#define DIGRF_TOP_PLLLSR_LRPDS_MASK              (0x1U)
#define DIGRF_TOP_PLLLSR_LRPDS_SHIFT             (0U)
#define DIGRF_TOP_PLLLSR_LRPDS_WIDTH             (1U)
#define DIGRF_TOP_PLLLSR_LRPDS(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLLSR_LRPDS_SHIFT)) & DIGRF_TOP_PLLLSR_LRPDS_MASK)

#define DIGRF_TOP_PLLLSR_LDPDS_MASK              (0x2U)
#define DIGRF_TOP_PLLLSR_LDPDS_SHIFT             (1U)
#define DIGRF_TOP_PLLLSR_LDPDS_WIDTH             (1U)
#define DIGRF_TOP_PLLLSR_LDPDS(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLLSR_LDPDS_SHIFT)) & DIGRF_TOP_PLLLSR_LDPDS_MASK)

#define DIGRF_TOP_PLLLSR_LDSLPS_MASK             (0x4U)
#define DIGRF_TOP_PLLLSR_LDSLPS_SHIFT            (2U)
#define DIGRF_TOP_PLLLSR_LDSLPS_WIDTH            (1U)
#define DIGRF_TOP_PLLLSR_LDSLPS(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLLSR_LDSLPS_SHIFT)) & DIGRF_TOP_PLLLSR_LDSLPS_MASK)

#define DIGRF_TOP_PLLLSR_LRSLPS_MASK             (0x8U)
#define DIGRF_TOP_PLLLSR_LRSLPS_SHIFT            (3U)
#define DIGRF_TOP_PLLLSR_LRSLPS_WIDTH            (1U)
#define DIGRF_TOP_PLLLSR_LRSLPS(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLLSR_LRSLPS_SHIFT)) & DIGRF_TOP_PLLLSR_LRSLPS_MASK)

#define DIGRF_TOP_PLLLSR_PLDCR_MASK              (0x10000U)
#define DIGRF_TOP_PLLLSR_PLDCR_SHIFT             (16U)
#define DIGRF_TOP_PLLLSR_PLDCR_WIDTH             (1U)
#define DIGRF_TOP_PLLLSR_PLDCR(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLLSR_PLDCR_SHIFT)) & DIGRF_TOP_PLLLSR_PLDCR_MASK)

#define DIGRF_TOP_PLLLSR_PLLDIS_MASK             (0x20000U)
#define DIGRF_TOP_PLLLSR_PLLDIS_SHIFT            (17U)
#define DIGRF_TOP_PLLLSR_PLLDIS_WIDTH            (1U)
#define DIGRF_TOP_PLLLSR_PLLDIS(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_PLLLSR_PLLDIS_SHIFT)) & DIGRF_TOP_PLLLSR_PLLDIS_MASK)
/*! @} */

/*! @name UNSRSR - LFAST Unsolicited Rx Status */
/*! @{ */

#define DIGRF_TOP_UNSRSR_URPCNT_MASK             (0x7U)
#define DIGRF_TOP_UNSRSR_URPCNT_SHIFT            (0U)
#define DIGRF_TOP_UNSRSR_URPCNT_WIDTH            (3U)
#define DIGRF_TOP_UNSRSR_URPCNT(x)               (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_UNSRSR_URPCNT_SHIFT)) & DIGRF_TOP_UNSRSR_URPCNT_MASK)

#define DIGRF_TOP_UNSRSR_URXDV_MASK              (0x100U)
#define DIGRF_TOP_UNSRSR_URXDV_SHIFT             (8U)
#define DIGRF_TOP_UNSRSR_URXDV_WIDTH             (1U)
#define DIGRF_TOP_UNSRSR_URXDV(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_UNSRSR_URXDV_SHIFT)) & DIGRF_TOP_UNSRSR_URXDV_MASK)
/*! @} */

/*! @name UNSRDR - LFAST Unsolicited Rx Data */
/*! @{ */

#define DIGRF_TOP_UNSRDR_UNRXD_MASK              (0xFFFFFFFFU)
#define DIGRF_TOP_UNSRDR_UNRXD_SHIFT             (0U)
#define DIGRF_TOP_UNSRDR_UNRXD_WIDTH             (32U)
#define DIGRF_TOP_UNSRDR_UNRXD(x)                (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_UNSRDR_UNRXD_SHIFT)) & DIGRF_TOP_UNSRDR_UNRXD_MASK)
/*! @} */

/*! @name GPR - General Purpose registers */
/*! @{ */

#define DIGRF_TOP_GPR_LFAST_TX_OBE_EN_MASK       (0x200000U)
#define DIGRF_TOP_GPR_LFAST_TX_OBE_EN_SHIFT      (21U)
#define DIGRF_TOP_GPR_LFAST_TX_OBE_EN_WIDTH      (1U)
#define DIGRF_TOP_GPR_LFAST_TX_OBE_EN(x)         (((uint32_t)(((uint32_t)(x)) << DIGRF_TOP_GPR_LFAST_TX_OBE_EN_SHIFT)) & DIGRF_TOP_GPR_LFAST_TX_OBE_EN_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DIGRF_TOP_Register_Masks */

/*!
 * @}
 */ /* end of group DIGRF_TOP_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_DIGRF_TOP_H_) */
